---
kind: method
id: M:Autodesk.Revit.DB.BaseArray.GetCopiedMemberIds
source: html/ce0d8197-a99f-0ef2-32a8-51d4cc2aa101.htm
---
# Autodesk.Revit.DB.BaseArray.GetCopiedMemberIds Method

Retrieves the copied member Ids of the Array.

## Syntax (C#)
```csharp
public abstract ICollection<ElementId> GetCopiedMemberIds()
```

## Returns
The copied member Ids of the Array